# Ejercicio Práctico Final - Parte 2
### Realizar una ingesta de datos de un archivo formato .csv utilizando la librería de Pandas

In [40]:
import pandas as pd #Importamos la libreria de Pandas para trabajar el conjunto de datos

#Creo el objeto df para importar el DataFrame con el que vamos a trabajar
df = pd.read_csv("D:/Dropbox/Capacitacion/ArgentinaPrograma4/APrograma4-1/etapa_02/Material/ProyectoFinal/Datasets/SalariosDataset.csv", sep = ",")

In [41]:
#Imprimir las primeras filas del df
df.head()

,Id,NombreEmpresa,TítuloTrabajo,SalariosInformados,Ubicación,Salario
0,0,Mu Sigma,Data Scientist,105,Bangalore,648573.0
1,1,IBM,Data Scientist,95,Bangalore,1191950.0
2,2,Tata Consultancy Services,Data Scientist,66,Bangalore,836874.0
3,3,Impact Analytics,Data Scientist,40,Bangalore,669578.0
4,4,Accenture,Data Scientist,32,Bangalore,944110.0

In [42]:
#Imprimir las ultimas filas
df.tail()

,Id,NombreEmpresa,TítuloTrabajo,SalariosInformados,Ubicación,Salario
4334,4339,TaiyōAI,Machine Learning Scientist,1,Mumbai,62160.0
4335,4340,Decimal Point Analytics,Machine Learning Developer,1,Mumbai,751286.0
4336,4341,MyWays,Machine Learning Developer,1,Mumbai,410952.0
4337,4342,Market Pulse Technologies,Software Engineer - Machine Learning,1,Mumbai,1612324.0
4338,4343,vPhrase,Machine Learning Engineer,1,Mumbai,939843.0

In [43]:
#Imprimir las dimensiones del dataset
print(df.shape)

(4339, 6)

In [44]:
#Totalidad de Registros por columnas
df.count()

Id                     4339
 NombreEmpresa         4339
 TítuloTrabajo         4339
 SalariosInformados    4339
 Ubicación             4339
 Salario               4339
dtype: int64

In [45]:
#Ver los tipos de dato de cada columna
df.dtypes

Id                       int64
 NombreEmpresa          object
 TítuloTrabajo          object
 SalariosInformados      int64
 Ubicación              object
 Salario               float64
dtype: object

In [46]:
#Listado de las columnas
print(df.columns)

Index(['Id', ' NombreEmpresa', ' TítuloTrabajo', ' SalariosInformados',
       ' Ubicación', ' Salario'],
      dtype='object')

In [47]:
#Eliminacion de columnas del df
df.drop(columns = ['Id'], inplace = True)

#Verifico la eliminación y muestro el resultado
print(df.shape)
df.head()

(4339, 5)

,NombreEmpresa,TítuloTrabajo,SalariosInformados,Ubicación,Salario
0,Mu Sigma,Data Scientist,105,Bangalore,648573.0
1,IBM,Data Scientist,95,Bangalore,1191950.0
2,Tata Consultancy Services,Data Scientist,66,Bangalore,836874.0
3,Impact Analytics,Data Scientist,40,Bangalore,669578.0
4,Accenture,Data Scientist,32,Bangalore,944110.0

In [48]:
#Determinar valores nulos por cada columna
print(df.isna().sum())

 NombreEmpresa         0
 TítuloTrabajo         0
 SalariosInformados    0
 Ubicación             0
 Salario               0
dtype: int64

In [49]:
#Describe Python
df.describe()

        SalariosInformados       Salario
count          4339.000000  4.339000e+03
mean              2.777138  1.119885e+06
std               5.148095  4.300905e+06
min               1.000000  1.081400e+04
25%               1.000000  4.199380e+05
50%               1.000000  7.062830e+05
75%               3.000000  1.196675e+06
max             105.000000  1.661404e+08